app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "test7"], ["room_number", 0]]
---
  def create
    school_class = SchoolClass.create(school_class_params(:title, :room_number))